In [1]:
print('problem 1')
print("Pythagorean triples")
a=int(input("Enter a number:"))
b=int(input("Enter b number:"))
c=int(input("Enter c number:"))
cc=c**2
h=a**2+b**2
if h==cc:
    print("triplets",h,"equal to",cc)
else:
    print("not a triplets")

problem 1
Pythagorean triples
Enter a number:12
Enter b number:5
Enter c number:13
triplets 169 equal to 169

In [4]:
print('Problem 2')
print('cube of given number')
num=int(input("Enter a number : "))
cube=num**3
print("Cube of ",num," is : ",cube)

Problem 2
cube of given number
Enter a number : 10
Cube of  10  is :  1000

In [5]:
import pandas as pd

In [6]:
dataset = pd.read_csv('F:\ds\ks.csv')

In [7]:
dataset.head()

    name   age
0    kavi   22
1  suguna   22

In [8]:
dataset.tail()

    name   age
0    kavi   22
1  suguna   22